---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.GetValues
source: html/0b4b428c-3f6f-98a3-298d-195d6a1bab24.htm
---
# Autodesk.Revit.DB.ExportPatternTable.GetValues Method

Returns all the values stored in the map.

## Syntax (C#)
```csharp
public IList<ExportPatternInfo> GetValues()
```

## Returns
Return the info array.